Homework/HW5/HW5_Sp15.tex
% Created 2015-03-19 Thu 18:26
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage{lmodern}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{amsmath}
\usepackage[version=3]{mhchem}
\usepackage[numbers,super,sort&compress]{natbib}
\usepackage{natmove}
\usepackage{url}
\usepackage{minted}
\usepackage{underscore}
\usepackage[linktocpage,pdfstartview=FitH,colorlinks,
linkcolor=blue,anchorcolor=blue,
citecolor=blue,filecolor=blue,menucolor=blue,urlcolor=blue]{hyperref}
\usepackage{attachfile}
\usepackage[left=1in, right=1in, top=1in, bottom=1in, nohead]{geometry}
\usepackage{fancyhdr}
\usepackage{hyperref}
\usepackage{setspace}
\usepackage[labelfont=bf]{caption}
\usepackage{amsmath}
\usepackage{enumerate}
\usepackage[parfill]{parskip}
\usepackage[version=3]{mhchem}
\date{Due: \textit{<2015-03-19 Thu>}}
\title{}
\begin{document}

\title{Homework 4\\Computational Chemistry\\(CBE 60547)}
\author{Prof.\ William F.\ Schneider}
\maketitle


In this homework, we will use \texttt{VASP} to perform plane wave density functional theory calculations. If you are having trouble, refer to the notes for Lab 3, or the \texttt{ase} website (\url{https://wiki.fysik.dtu.dk/ase/index.html}) or dft-book (\url{http://kitchingroup.cheme.cmu.edu/dft-book/dft.html}).

\section{Not Ar again! \label{sec:Ar}}
\label{sec-1}

As they say, there are many ways to skin a cat! You have computed the wavefunctions of Ar several different ways in homework already — using \texttt{FDA}, the descendent of Hartree’s first calculations, and using the molecular orbital \texttt{GAMESS} code — so it is only natural to do the same using \texttt{VASP}. 

Create an atoms object for Ar centered in a 12 \texttimes{} 12 \texttimes{} 12 \AA{} unit cell. Perform a \texttt{VASP} calculation using the PBE exchange correlation functional, Gaussian smearing, and a small sigma value (0.01). Answer the following questions.

\begin{enumerate}[(a)]
\item What are the total number of electrons in the calculation? (Hint: \verb~calc.get_number_of_electrons()~)

\item What is the potential energy of the Ar atom?

\item How many SCF iterations does it take to converge?

\item Identify the orbitals. What are their occupancies and energies? Which orbitals are kept in the core? (Hint: \verb~calc.get_eigenvalues()~, \verb~calc.get_occupation_numbers()~)

\item How many basis functions are in the calculation? (VASP doesn't always print this for bigger systems, as such there is no in-built function in ase. Look in the OUTCAR file to figure this out).
\end{enumerate}


\section{Sensitivity to Planewave cutoff}
\label{sec-2}

We will now study the effect of choosing different planewave cutoffs. Perform the calculation in problem \ref{sec:Ar} for different values of encut (100, 200, 300, 400, 500 eV) and plot out the potential energy. At what cutoff is the energy converged to 0.005 eV? How does the computational cost scale with the cutoff?


\section{Spin polarized Calculations}
\label{sec-3}

Now let’s try a spin-polarized atom. Create the calculation above for an O atom in the same-sized box. To turn on spin-polarization set \verb~ispin=2~. The POTCAR recommends a cutoff of 400 eV, so use that as your value for \verb~encut~. Answer the following questions:

\begin{enumerate}[(a)]
\item What is the final potential energy of the O atom?

\item What is the number of spin-up minus spin-down electrons? Does it make sense for an O atom? (Hint: \verb~atoms.get_magnetic_moment()~)

\item Identify the orbitals, their occupancies and energies? Do the occupancies make sense? (For the expert users, MAGMOM, FERWE, and FERDO can be used to adjust all these. You could also break the symmetry of the box to converge to the lower symmetry solution).
\end{enumerate}

Hint: Use \verb~calc.get_eigenvalues(spin=n)~, \verb~calc.get_occupation_numbers(spin=n)~, where n=0,1, to get the spin up and spin down orbitals.

\section{Geometry Optimization}
\label{sec-4}

Now let’s do an O2 molecule. Create an atoms object with the two atoms an appropriate distance apart. Turn on spin-polarization and set up the calculation to perform at most 20 ionic relaxation steps using the quasi-newton relaxation algorithm. Use a small sigma value and the PBE functional. Answer the following questions.

\begin{enumerate}[(a)]
\item Did the geometry converge? (\verb~calc.read_convergence()~)

\item How many relaxation steps were taken? (\verb~calc.get_number_of_ionic_steps()~)

\item What is the final O$_{\text{2}}$ energy?

\item What is the magnetic moment? Does this make sense for an O$_{\text{2}}$ molecule?

\item What are the final orbital identities, energies and occupancies?
\end{enumerate}

\section{Vibrational Frequencies and Zero Point Energies}
\label{sec-5}

Vasp can also calculate vibrational frequencies. Set \verb~ibrion=6~ to turn on a finite-differences frequency calculation, \verb~nfree=2~ to do a step in the positive and negative direction, and \verb~potim=0.010~ for the step size in \AA{}.

\begin{enumerate}[(a)]
\item What is the computed O$_{\text{2}}$ frequency, in wavenumbers? (Hint: \verb~calc.get_vibrational_frequencies()~)

\item What is its zero-point energy?

\item Calculate the zero-point corrected bond energy of O$_{\text{2}}$. How does your answer compare to experiment?
\end{enumerate}
% Emacs 24.4.3 (Org mode 8.2.10)
\end{document}